Q1. List any five functions of the pandas library with execution.

1. value_counts()
Pandas’ value_counts() function is used to show the counts of all unique elements in columns of a dataframe. 

2. group_by()
With Pandas group_by, we can split and group our dataframe by certain columns to be able to view patterns and details in the data. 

3. loc and iloc
Indexing in Pandas is one of the most basic operations and the best way to do it is using either loc or iloc. “Loc” stands for location and the “i” stands for indexed location. In other words, when you want to index a dataframe using names or labels of columns/rows, you’d use loc. And when you want to index columns or rows using the positions, you’d use the iloc function.

4. unique() and nunique()
Pandas unique is used to get all the unique values from any feature. This is mostly used to get the categories in categorical features in the data. Unique shows all the unique values including NaNs. It treats it as a different unique value.

5. head()
Returns the first 5 rows from the data frame

In [4]:
import pandas as pd

In [212]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [216]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [220]:
df.groupby('Sex').sum()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,135343,233,678,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)Heikkinen, Miss. LainaFutrelle, Mrs. Jacques Heath (Lily May Peel)Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)Nasser, Mrs. Nicholas (Adele Achem)Sandstrom, Miss. Marguerite RutBonnell, Miss. ElizabethVestrom, Miss. Hulda Amanda AdolfinaHewlett, Mrs. (Mary D Kingcome) Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)Masselmani, Mrs. FatimaMcGowan, Miss. Anna ""Annie""Palsson, Miss. Torborg DaniraAsplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)O'Dwyer, Miss. Ellen ""Nellie""Spencer, Mrs. William Augustus (Marie Eugenie)Glynn, Miss. Mary AgathaVander Planke, Miss. Augusta MariaNicola-Yarred, Miss. JamilaAhlin, Mrs. Johan (Johanna Persdotter Larsson)Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)Laroche, Miss. Simonne Marie Anne AndreeDevaney, Miss. Margaret DeliaO'Driscoll, Miss. BridgetArnold-Franchi, Mrs. Josef (Josefine Franchi)Harper, Mrs. Henry Sleeper (Myna Haxtun)Faunthorpe, Mrs. Lizzie (Elizabeth Anne ...",7286.00,218,204,PC 17599STON/O2. 3101282113803347742237736PP 95491137833504062487063457632649330923349909347077330959PC 175693356773457642651754611668SC/Paris 212333095814311349237PC 175722926C.A. 31026C.A. 34651113572C.A. 293953101281CA 2144364516330932SO/C 14885310127819950231919349245343120371110266541362627347082272672668A/5. 3337228414117522678347081STON/O2. 3101279W./C. 660811377635851C.A. 33595113505347088347742PC 17595CA. 2343315153370365234604350046PC 17610PC 17569370370248747347054367231F.C.C. 1352835273STON/O2. 310128311813413336973347077W./C. 6609C.A. 3192126653672303470712506493470543701292650PC 17585110152PC 17755230433382649PC 17582PC 1776025064437037513502347073C.A. 26733703731987711967349236113781PC 17558923422659317421PC 17758PC 1748511767PC 176082506513474702443673692816966234818248738PC 1776028551363291111361367226PC 176111696619950248733314183865251135052376713309313309802691110813262614313PC 17477349909PC 17604C 7077PC 17757265311378927849SC 174835273PP 9549350407240929413731...,13966.6628,C85C123G6C103B78D33B28F33C23 C25 C27E101F E69D47C2E33C49B4B80G6D36D15C83G6B77C125C99D7B49C22 C26B58 B60E101C65E36C54B57 B59 B63 B66C7E34C32DB18E40C23 C25 C27F33E33D37B35D36G6C78B96 B98D21DC93D20C22 C26B79F33B73B18B39B22A16E67C101E44C68E68D20C125F4D9B35C126B5C62 C64C90C45E101B5B57 B59 B63 B66B77B96 B98D11E77B3B20D17E8B69E121B28E49C92D28D17D35C50B42,CSSSCSSSSSCQSSQCQSCSSCQQSCSSSSSSSQSSSSSSQCSCSSCSSSCSSSSQSSSSCSSQSSCCQSSQSCSCSSSSSCQSSSSCCSCSQSSSQSSSQSCSSCQQCCCCCSSSSCQSCSSCQSCSSSSSSQQCCCQCSCSCCSSCCSSSSSSQSSSSSSSSSSSSSSSCSSCSCSSSSSCSQQSSSCSSSCSSCSSCCSSSSSCSSSSSQSSCSCSCQSSCSSQSSSSSSSCSCSSQQQSSSSQSCQCCSSCCSSSQSSSCSSSSSSQSSSSCSSSSSSSSSSSSSCCCCCSSSSCSSSCSCCCSSQSS
male,262043,109,1379,"Braund, Mr. Owen HarrisAllen, Mr. William HenryMoran, Mr. JamesMcCarthy, Mr. Timothy JPalsson, Master. Gosta LeonardSaundercock, Mr. William HenryAndersson, Mr. Anders JohanRice, Master. EugeneWilliams, Mr. Charles EugeneFynney, Mr. Joseph JBeesley, Mr. LawrenceSloper, Mr. William ThompsonEmir, Mr. Farred ChehabFortune, Mr. Charles AlexanderTodoroff, Mr. LalioUruchurtu, Don. Manuel EWheadon, Mr. Edward HMeyer, Mr. Edgar JosephHolverson, Mr. Alexander OskarMamee, Mr. HannaCann, Mr. Ernest CharlesKraeff, Mr. TheodorRogers, Mr. William JohnLennon, Mr. DenisSamaan, Mr. YoussefPanula, Master. Juha NiiloNosworthy, Mr. Richard CaterOstby, Mr. Engelhart CorneliusWoolner, Mr. HughNovel, Mr. MansouerGoodwin, Master. William FrederickSirayanian, Mr. OrsenHarris, Mr. Henry BirkhardtSkoog, Master. HaraldStewart, Mr. Albert AMoubarek, Master. GeriosCrease, Mr. Ernest JamesKink, Mr. VincenzJenkin, Mr. Stephen CurnowHood, Mr. Ambrose JrChronopoulos, Mr. ApostolosBing, Mr. LeeMoen, Mr. Sigurd Hanse...",13919.17,248,136,A/5 2117137345033087717463349909A/5. 2151347082382652244373239865248698113788263119950349216PC 17601C.A. 24579PC 176041137892677A./5. 2152349253S.C./A.4. 2356737037126623101295A/4. 39886113509199472697CA 2144266936973347088PC 176052661S.P. 3464315151C.A. 33111S.O.C. 1487926801601348123349208374746248738345767345779113059W./C. 6608SOTON/OQ 392086343275343276347466W.E.P. 5734C.A. 2315364500374910PC 17754PC 177592443673492153528175403101276349207312991349249110465324669STON/O 2. 310129437036911668PC 17558S.O.C. 14879A4. 54510237736352812651370372C 17369347061349241SOTON/O.Q. 3101307C.A. 29178SC/PARIS 21331138037534PC 17593365222231945C.A. 33112350043230080244310S.O.P. 1166A.5. 11206A/5. 851Fa 265302PC 17597SOTON/OQ 392090315037CA. 23433713623470683150933101295363291PC 173181601111240382652STON/O 2. 3101280177643504044133250653LINESC/PARIS 2131347077230136113767111428364849349247284242300803687034579345770CA. 234331012642628A/5 354031012782699112277SOTON/O.Q. 3101311A/5 211742506463672...,14727.2865,E46D56A6C23 C25 C27B30C52C83F G73E31A5D10 D12D26C110B58 B60D26C123B86F2B19A7F4A32F2A31C93C78D35C87E67B94C118A19DC106C22 C26C124C91C2TF2C128E50C82B96 B98E10C52E44C23 C25 C27A34C104C111C92E38E12E63A14B49B37C30C65E25D46C95B38C86C70E25A10B41A20D19D50A23B50D33A26D48E58B71B51 B53 B55D49B20C68F G63E24E24C124C126F G73E8B101D45C46B22D30E121F38D6B82 B84B96 B98A36B102C47E17A24B51 B53 B55C148,SSQSSSSQSSSSCSSCSCSCSCSQCSSCSCSCSSCCSSSSCSSSSSSSSSSSSSSSSSCCSSSSSSSSSSSQSCSSCSCQSSCSSCSSCQSSSSSSSSSCSSSSSSSSSSSQSCSSSSCSSSSQSSSQSSSSCSSCCSSSQSSSSSSSSSSSSSSSSSSSCQSSSSSQSSSSSSSSCSQQSSSSCSSSCSCCSQSSSCSSSSSSSSSSSSSSSSSSSSSSCSCSSCSQSCSSCCCSSSSSQSSSSSSSSSSSSSSQSSSCQSSSQSSSSSSSSSSSSSSCCSCSQSSSSSSSSQSSSSSSSSSCCSSSSSCSCSSSCSSSQSSSSQSSCCQSSSCCSSSCSCSSCSQCSCQSSSSSCSSSSSSSCCSCSSSSSSSCCSSSCSSSSQSSSCSCSSSQSQSSCSSSSSSCSCSSSSSSCSCSSSSSSSSSSSSSCCSSSCSSSSSCSSSCSSQSSSCSSSSSQSSSSSSSCSSSSCSSSSSSSSSQSSSSSSSSSCSCQSSSCSQQSSSSQSCQSCSSCSSCSSSSSSSSSCSSSSSQSCQSCSSSSSCSSCSSSCSSSSCSSSSSSSSSSSSSSSSCQ

In [222]:
df.loc[2,'Sex']

'female'

In [224]:
df.iloc[0:5,4]

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [226]:
df['Fare'].unique()

array([  7.25  ,  71.2833,   7.925 ,  53.1   ,   8.05  ,   8.4583,
        51.8625,  21.075 ,  11.1333,  30.0708,  16.7   ,  26.55  ,
        31.275 ,   7.8542,  16.    ,  29.125 ,  13.    ,  18.    ,
         7.225 ,  26.    ,   8.0292,  35.5   ,  31.3875, 263.    ,
         7.8792,   7.8958,  27.7208, 146.5208,   7.75  ,  10.5   ,
        82.1708,  52.    ,   7.2292,  11.2417,   9.475 ,  21.    ,
        41.5792,  15.5   ,  21.6792,  17.8   ,  39.6875,   7.8   ,
        76.7292,  61.9792,  27.75  ,  46.9   ,  80.    ,  83.475 ,
        27.9   ,  15.2458,   8.1583,   8.6625,  73.5   ,  14.4542,
        56.4958,   7.65  ,  29.    ,  12.475 ,   9.    ,   9.5   ,
         7.7875,  47.1   ,  15.85  ,  34.375 ,  61.175 ,  20.575 ,
        34.6542,  63.3583,  23.    ,  77.2875,   8.6542,   7.775 ,
        24.15  ,   9.825 ,  14.4583, 247.5208,   7.1417,  22.3583,
         6.975 ,   7.05  ,  14.5   ,  15.0458,  26.2833,   9.2167,
        79.2   ,   6.75  ,  11.5   ,  36.75  ,   7.7958,  12.525 ,
        66.6   ,   7.3125,  61.3792,   7.7333,  69.55  ,  16.1   ,
        15.75  ,  20.525 ,  55.    ,  25.925 ,  33.5   ,  30.6958,
        25.4667,  28.7125,   0.    ,  15.05  ,  39.    ,  22.025 ,
        50.    ,   8.4042,   6.4958,  10.4625,  18.7875,  31.    ,
       113.275 ,  27.    ,  76.2917,  90.    ,   9.35  ,  13.5   ,
         7.55  ,  26.25  ,  12.275 ,   7.125 ,  52.5542,  20.2125,
        86.5   , 512.3292,  79.65  , 153.4625, 135.6333,  19.5   ,
        29.7   ,  77.9583,  20.25  ,  78.85  ,  91.0792,  12.875 ,
         8.85  , 151.55  ,  30.5   ,  23.25  ,  12.35  , 110.8833,
       108.9   ,  24.    ,  56.9292,  83.1583, 262.375 ,  14.    ,
       164.8667, 134.5   ,   6.2375,  57.9792,  28.5   , 133.65  ,
        15.9   ,   9.225 ,  35.    ,  75.25  ,  69.3   ,  55.4417,
       211.5   ,   4.0125, 227.525 ,  15.7417,   7.7292,  12.    ,
       120.    ,  12.65  ,  18.75  ,   6.8583,  32.5   ,   7.875 ,
        14.4   ,  55.9   ,   8.1125,  81.8583,  19.2583,  19.9667,
        89.1042,  38.5   ,   7.725 ,  13.7917,   9.8375,   7.0458,
         7.5208,  12.2875,   9.5875,  49.5042,  78.2667,  15.1   ,
         7.6292,  22.525 ,  26.2875,  59.4   ,   7.4958,  34.0208,
        93.5   , 221.7792, 106.425 ,  49.5   ,  71.    ,  13.8625,
         7.8292,  39.6   ,  17.4   ,  51.4792,  26.3875,  30.    ,
        40.125 ,   8.7125,  15.    ,  33.    ,  42.4   ,  15.55  ,
        65.    ,  32.3208,   7.0542,   8.4333,  25.5875,   9.8417,
         8.1375,  10.1708, 211.3375,  57.    ,  13.4167,   7.7417,
         9.4833,   7.7375,   8.3625,  23.45  ,  25.9292,   8.6833,
         8.5167,   7.8875,  37.0042,   6.45  ,   6.95  ,   8.3   ,
         6.4375,  39.4   ,  14.1083,  13.8583,  50.4958,   5.    ,
         9.8458,  10.5167])

In [227]:
df['Fare'].nunique()

248

In [228]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [229]:
data = {'a':[1,2,3,4],
        'b':[2,3,4,5],
        'c':[3,4,5,6]       
       }

In [230]:
df = pd.DataFrame(data)

In [242]:
list(range(1,5,2))

[1, 3]

In [248]:
newlist = list(range(1, 2*len(df),2))

[1, 3, 5, 7]

In [238]:
df.reindex(new)

In [239]:
df

   a  b  c
2  1  2  3
3  2  3  4
4  3  4  5
5  4  5  6

In [237]:
range(10)

range(0, 10)

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [1]:
data = {'Values':[10,20,30,40,50]}

In [2]:
data

{'Values': [10, 20, 30, 40, 50]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [11]:
def sum(x):
    for i in range(0,3):
        x[i] += x[i]
    print(x[i])
df.apply(sum)

60

Values    None
dtype: object

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
data1 = {"text":['Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.', 'Data science is an interdisciplinary academic field[1] that uses statistics, scientific computing, scientific methods, processes, algorithms and systems to extract or extrapolate knowledge and insights from noisy, structured, and unstructured data']}

In [13]:
data1

{'text': ['Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.',
  'Data science is an interdisciplinary academic field[1] that uses statistics, scientific computing, scientific methods, processes, algorithms and systems to extract or extrapolate knowledge and insights from noisy, structured, and unstructured data']}

In [14]:
df1 = pd.DataFrame(data1)

In [15]:
df1

                                                text
0  Data science is the study of data to extract m...
1  Data science is an interdisciplinary academic ...

In [23]:
df1['word_count'] = df1['text'].apply(lambda x : len(x.split()))

In [24]:
df1

                                                text  word_count
0  Data science is the study of data to extract m...          40
1  Data science is an interdisciplinary academic ...          31

Q5. How are DataFrame.size() and DataFrame.shape() different?

The size property returns the number of elements in the DataFrame. The number of elements is the number of rows * the number of columns.

The shape property returns a tuple containing the shape of the DataFrame. The shape is the number of rows and columns of the DataFrame

In [25]:
df1

                                                text  word_count
0  Data science is the study of data to extract m...          40
1  Data science is an interdisciplinary academic ...          31

In [29]:
df1.size

4

In [30]:
df1.shape

(2, 2)

Q6. Which function of pandas do we use to read an excel file?


pd.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [31]:
data2 = {"Email" : ['test1@gmail.com','test2@hotmail.com','test3@yahoo.com']}

In [32]:
data2

{'Email': ['test1@gmail.com', 'test2@hotmail.com', 'test3@yahoo.com']}

In [33]:
df2 =  pd.DataFrame(data2)

In [46]:
df2['username'] = df2['Email'].apply(lambda x: x.split(sep ='@')[0])

In [47]:
df2

               Email username
0    test1@gmail.com    test1
1  test2@hotmail.com    test2
2    test3@yahoo.com    test3

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

  A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows: A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [48]:
data = {'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]
       }

In [49]:
df4 = pd.DataFrame(data)

In [50]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [84]:
df5 = df4[(df4['A'] > 5) & (df4['B'] <10)]

In [85]:
df5

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [86]:
data = {'Values':[10,20,30,40,50]}

In [87]:
df6 = pd.DataFrame(data)

In [89]:
df6.mean()

Values    30.0
dtype: float64

In [90]:
df6.median()

Values    30.0
dtype: float64

In [91]:
df6.std()

Values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [97]:
data = {'Sales':[100,101,102,102,104,105,105,100,101,102,102,104,105,105],
        'Date':["18-09-2023","19-09-2023","20-09-2023","21-09-2023","22-09-2023","23-09-2023","24-09-2023","18-09-2023","19-09-2023","20-09-2023","21-09-2023","22-09-2023","23-09-2023","24-09-2023"]
    
    
}

In [98]:
data

{'Sales': [100,
  101,
  102,
  102,
  104,
  105,
  105,
  100,
  101,
  102,
  102,
  104,
  105,
  105],
 'Date': ['18-09-2023',
  '19-09-2023',
  '20-09-2023',
  '21-09-2023',
  '22-09-2023',
  '23-09-2023',
  '24-09-2023',
  '18-09-2023',
  '19-09-2023',
  '20-09-2023',
  '21-09-2023',
  '22-09-2023',
  '23-09-2023',
  '24-09-2023']}

In [99]:
df7 = pd.DataFrame(data)

In [100]:
df7

    Sales        Date
0     100  18-09-2023
1     101  19-09-2023
2     102  20-09-2023
3     102  21-09-2023
4     104  22-09-2023
5     105  23-09-2023
6     105  24-09-2023
7     100  18-09-2023
8     101  19-09-2023
9     102  20-09-2023
10    102  21-09-2023
11    104  22-09-2023
12    105  23-09-2023
13    105  24-09-2023

In [104]:
df7['MovingAverage'] = df7['Sales'].rolling(window=7).mean()

In [105]:
df7

    Sales        Date  MovingAverage
0     100  18-09-2023            NaN
1     101  19-09-2023            NaN
2     102  20-09-2023            NaN
3     102  21-09-2023            NaN
4     104  22-09-2023            NaN
5     105  23-09-2023            NaN
6     105  24-09-2023     102.714286
7     100  18-09-2023     102.714286
8     101  19-09-2023     102.714286
9     102  20-09-2023     102.714286
10    102  21-09-2023     102.714286
11    104  22-09-2023     102.714286
12    105  23-09-2023     102.714286
13    105  24-09-2023     102.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:

Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [106]:
data = {'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}

In [107]:
df = pd.DataFrame(data)

In [109]:
df['Date'] = pd.to_datetime(df['Date'])

In [110]:
df['Weekday'] = df['Date'].dt.day_name()

In [111]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [130]:
data = pd.date_range(start = '2022-12-12' ,end = '2023-02-22')

In [131]:
data

DatetimeIndex(['2022-12-12', '2022-12-13', '2022-12-14', '2022-12-15',
               '2022-12-16', '2022-12-17', '2022-12-18', '2022-12-19',
               '2022-12-20', '2022-12-21', '2022-12-22', '2022-12-23',
               '2022-12-24', '2022-12-25', '2022-12-26', '2022-12-27',
               '2022-12-28', '2022-12-29', '2022-12-30', '2022-12-31',
               '2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31', '2023-02-01',
               '2023-02-02', '2023-02-03', '2023-02-04', '2023-02-05',
               '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09',
               '2023-02-10', '2023-02-11', '2023-02-12', '2023-02-13',
               '2023-02-14', '2023-02-15', '2023-02-16', '2023-02-17',
               '2023-02-18', '2023-02-19', '2023-02-20', '2023-02-21',
               '2023-02-22'],
              dtype='datetime64[ns]', freq='D')

In [132]:
df = pd.DataFrame({"Date": data})

In [133]:
df['Date'] = pd.to_datetime(df['Date'])

In [134]:
df.dtypes

Date    datetime64[ns]
dtype: object

In [127]:
df['Date'].dtypes

dtype('O')

In [123]:
Start_date = pd.to_datetime('2023-01-01')

In [136]:
end_date = pd.to_datetime('2023-01-31')

In [138]:
df[(df['Date'] > Start_date) & (df['Date'] < end_date)]

         Date
21 2023-01-02
22 2023-01-03
23 2023-01-04
24 2023-01-05
25 2023-01-06
26 2023-01-07
27 2023-01-08
28 2023-01-09
29 2023-01-10
30 2023-01-11
31 2023-01-12
32 2023-01-13
33 2023-01-14
34 2023-01-15
35 2023-01-16
36 2023-01-17
37 2023-01-18
38 2023-01-19
39 2023-01-20
40 2023-01-21
41 2023-01-22
42 2023-01-23
43 2023-01-24
44 2023-01-25
45 2023-01-26
46 2023-01-27
47 2023-01-28
48 2023-01-29
49 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

import pandas